'''Тут слова на которые реагирует бот'''

TRIGGERS = {'сева', 'сефа', 'все', 'сев', 'севас', 'севасек', 'ну', 'пожалуйста', 'найди', 'село'}




data_set = {

# ЮТУБ
'посмотрим ютуб': 'youtubeStart запускаю ютуб',
'глянь что на ютубе': 'youtubeStart запускаю ютуб',
'открой ютуб': 'youtubeStart запускаю ютуб',

# ГУГЛ
'открой гугл': 'googleStart google активирован',
'гугл': 'googleStart google активирован',
'нужен гугл': 'googleStart google активирован',

# ФИЛЬМЫ
'хочу посмотреть фильмы': 'zetflix открываю зетфликс, приятного просмотра',
'сериал найди': 'zetflix открываю зетфликс, приятного просмотра',
'зетфликс открой': 'zetflix открываю зетфликс, приятного просмотра',

# ДНЕВНИК
'дневник открой': 'eljur сейчас открою дневник',
'узнай какие пары': 'eljur сейчас открою дневник',
'посмотри что задали': 'eljur сейчас открою дневник',

# VK
'открой контакт': 'vk октрываю ВК',
'контакт посмотри': 'vk октрываю ВК',
'посмотри что написали': 'vk октрываю ВК',

# МУЗЫКА ВК
'включи мою музыку': 'musicVK включаю вашу музыку в ВК',
'включи музыку вк': 'musicVK включаю вашу музыку в ВК',
'музыка контакт': 'musicVK включаю вашу музыку в ВК',

# ИГРА
'хочу поиграть в суприм': 'game лишь бы баловаться',
'запусти стратежку': 'game лишь бы баловаться',
'поиграем в суприм': 'game лишь бы баловаться',

# КНИГА
'давай почитаем': 'read открываю бай оф пайтон. Сегодня почитаешь про язык питон',
'открой книгу питон': 'read открываю бай оф пайтон',
'давай читать кнугу': 'read открываю бай оф пайтон',

# ОТКЛЮЧАЕТ БОТА
'отключись': 'offBot отключаюсь',
'подожди': 'offBot хорошо, я пока посплю',
'пока': 'offBot прощай',

# ОТКЛЮЧЕНИЕ ПК
'выключи компьютер': 'offpc отключаю компьютер',

# МОНЕТКА
'кинь монетку': 'monetka кидаю монетку',
'орел или решка': 'monetka кидаю монетку',
'подбрось монетку': 'monetka кидаю монетку',

# ВРЕМЯ
'сколько времени': 'time считаю время',
'укажи время': 'time считаю время',
'посмотри время': 'time считаю время',

# ПОГОДА
'какая щас погода': 'weather собираю данные',
'что на улице': 'weather собираю данные',
'какая температура': 'weather собираю данные',

# ЗАПИСЬ МЫСЛЕЙ
'сделай заметку': 'newText открываю блокнот',

# ФАЙЛ С ИНФОРМАЦИЕЙ О БОТЕ
'покажи о себе информацию':'textOpis открываю свою документацию',
'расскажи о себе':'textOpis открываю свою документацию',

# ПАССИВНЫЕ ОТВЕТЫ
'привет':'passive привет, как ваше настроение ?',
'нормально, а у тебя':'passive у меня отлично, я все больше получаю нужных функций',
'как у тебя дела':'passive работаю в фоне, не переживай',
'что делаешь':'passive жду очередной команды, хоть мог бы и сам на кнопку нажать',
'ты работаешь':'passive как видишь',
'приступим тогда':'passive соскучился по нашей работе, что будем делать?',
'сегодня поизучаем новое':'passive нууууу, а меня улучшать не будем ?',
'мне надо узнать новое, чтобы улучшить тебя':'passive ну в таком случае хорошо',
'ты тут':'passive вроде да, вы что то хотели ?',
'что ты умеешь': 'passive я умею узнавать погоду, могу открыть браузер, запустить exe файл, выключить пк, отключиться, смотреть время, искать термины и многое другое',

# TELEGRAM
'запусти телегу':'teleg запускаю',
'телегу запусти':'teleg запускаю',
'что там в телеге':'teleg запускаю',





# ФОНОВЫЙ РЕЖИМ
# 'не мешай':'sleept хорошо',

# ВИКИПЕДИЯ
# 'мне информацию в википедии о': 'wiki ищу',
# 'найди мне о': 'wiki ищу',
# 'что такое': 'wiki ищу',

# ГУГЛ ПОИСКОВИК
# 'найди': 'siteSearch нашел информацию',
# 'ищи': 'siteSearch нашел информацию',
# 'найти': 'siteSearch нашел информацию',

# ЮТУБ ПОИСКОВИК
# 'найди видео': 'search_for_video_on_youtube ищу, подождите...',
# 'поищи видео': 'search_for_video_on_youtube ищу, подождите...',
# 'найди на ютуб': 'search_for_video_on_youtube ищу, подождите...',

}










